#+title: Lab1
#+PROPERTY: header-args :results drawer

Welcome to Lab1 of *Leveraging Kubernetes for Drupal: A Beginner's Laboratory*

To set up a fully functional Drupal site on a k3d Kubernetes cluster on Linux, follow these steps.
This guide assumes you have Docker installed on your Linux system. If not, please install it first from https://docs.docker.com/engine/install/.

Each major action is broken down into steps, with each step containing the necessary commands and explanations.

** Step 1: Install kind or k3d
   :PROPERTIES:
   :CUSTOM_ID: install-k3d
   :END:

      KIND:
   1. Download and install the latest version of kind.
      #+BEGIN_SRC bash
      [ $(uname -m) = x86_64 ] && curl -Lo ./kind https://kind.sigs.k8s.io/dl/v0.24.0/kind-linux-amd64
      chmod +x ./kind
      sudo mv ./kind /usr/local/bin/kind
      #+END_SRC
   2. Verify the installation.
      #+BEGIN_SRC shell
      kind version
      #+END_SRC

      #+RESULTS:
      :results:
      kind v0.24.0 go1.22.6 linux/amd64
      :end:

      K3D:
   1. Download and install the latest version of k3d.
      #+BEGIN_SRC bash
      wget -q -O - https://raw.githubusercontent.com/rancher/k3d/main/install.sh | bash
      #+END_SRC
   2. Verify the installation.
      #+BEGIN_SRC shell
      k3d version
      #+END_SRC

      #+RESULTS:
      :results:
      k3d version v5.7.4
      k3s version v1.30.4-k3s1 (default)
      :end:


** Step 3: Install Helm
   :PROPERTIES:
   :CUSTOM_ID: install-helm
   :END:
   1. Download and install Helm.
      #+BEGIN_SRC bash
      curl https://raw.githubusercontent.com/helm/helm/master/scripts/get-helm-3 | bash
      #+END_SRC
   2. Verify Helm installation.
      #+BEGIN_SRC bash
      helm version
      #+END_SRC

      #+RESULTS:
      :results:
      version.BuildInfo{Version:"v3.16.1", GitCommit:"5a5449dc42be07001fd5771d56429132984ab3ab", GitTreeState:"clean", GoVersion:"go1.22.7"}
      :end:

** Step 7: Access Your Drupal Site
   :PROPERTIES:
   :CUSTOM_ID: access-drupal
   :END:

   1. Get your Drupal login credentials by running:
      #+BEGIN_SRC bash
      echo Username: user
      echo Password: $(kubectl get secret --namespace default my-drupal -o jsonpath="{.data.drupal-password}" | base64 -d)
      #+END_SRC

      #+RESULTS:
      :results:
      Username: user
      Password: TgvYoqZZWc
      :end:

   2. Find the Drupal pod name and Forward port 8080 to the Drupal pod.
      #+BEGIN_SRC bash
      DPOD=$(kubectl get pods --namespace default -l "app.kubernetes.io/name=drupal" -o jsonpath="{.items[0].metadata.name}")
      kubectl port-forward --namespace default --address 127.0.0.1 $DPOD 8080:8080
      #+END_SRC

   3. Access Drupal site at http://localhost:8080.

** Ensure Pods are Running and Ready
   #+BEGIN_SRC bash
   kubectl get pods
   #+END_SRC

   #+RESULTS:
   :results:
   NAME                         READY   STATUS    RESTARTS   AGE
   my-drupal-84766b946f-m4pcd   1/1     Running   0          37m
   my-drupal-mariadb-0          1/1     Running   0          37m
   :end:

